app/controllers/api_controller.rb

    def getRandom
        render json: Piece.all.sample()
---
SELECT "pieces".* FROM "pieces"